<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ taglib prefix="s" uri="/struts-tags"%>
<h2>关于网上书店</h2>
<div id="about">
  <p>叮当网在线书店是一个小型专业的电子商务网站项目，用户可以在线浏览、选购图书。</p>
  <p>
               本电子商务网站基于目前流行的Java Web三大框架（Struts, Spring 和 Hibernate）开发，严格遵循模型-视图-控制器，即MVC设计模式。
               其中利用Struts框架及其标签库实现了控制器和视图，而模型则分为三层，分别为业务(Service)层（即业务模型）、数据访问(DAO)层（即数据访问模型）和持久层(由Hibernate框架实现)，
               项目代码结构清晰，整洁易读，对于学习Java Web开发是非常值得参考的。
  </p>
  <p>
               本项目实现了一个电子商务网站前端面向互联网用户的基本功能，目前版本尚未提供后台图书发布和管理、订单管理和货物派送等功能，下个版本将提供这些功能。
  </p>
  <p>
               本项目的源代码完全开放，可以任意修改，无需承担任何法律责任，只是希望获得此源码的人能够将此项目做得更加完善，并能就不足和改进之处与我交流，我的QQ号是：53517099
  </p>
</div>